Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные: 
[1, 1, 1, 2, 2, 3, 3], 
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [3]:
import pandas as pd

In [4]:
authors = pd.DataFrame({
    'author_id': [1, 2, 3],
    'author_name':
['Тургенев', 'Чехов', 'Островский'],
})

authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [5]:
books = pd.DataFrame({
    'author_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': ['Отцы и дети', 'Рудин', 
                   'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    'price':[450, 300, 350, 500, 450, 370, 290],
})

books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [6]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')

In [7]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [18]:
top5 = authors_price.sort_values(by="price")

top5 = top5.tail(5)

top5.reset_index(drop=True, inplace=True)
top5

   author_id author_name         book_title  price
0          1    Тургенев  Дворянское гнездо    350
1          3  Островский              Гроза    370
2          1    Тургенев        Отцы и дети    450
3          2       Чехов    Дама с собачкой    450
4          2       Чехов   Толстый и тонкий    500

Так коректнее

In [20]:
top5 = authors_price.nlargest(5, "price")
top5.reset_index(drop=True, inplace=True)
top5

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора,минимальная, максимальная и средняя цена на книги этого автора.

In [30]:
groupby = authors_price.groupby("author_name")
groupby

In [31]:
groupby["price"].mean()

author_name
Островский    330.000000
Тургенев      366.666667
Чехов         475.000000
Name: price, dtype: float64

In [32]:
groupby["price"].max()

author_name
Островский    370
Тургенев      450
Чехов         500
Name: price, dtype: int64

In [33]:
groupby["price"].max()

author_name
Островский    370
Тургенев      450
Чехов         500
Name: price, dtype: int64

In [15]:
type(groupby)

pandas.core.groupby.generic.DataFrameGroupBy

In [47]:
authors_stat = pd.DataFrame({
                '': authors_price.groupby(["author_name"]),
                'price max': groupby["price"].max(),
                'price min': groupby["price"].min(),
                'price mean': groupby["price"].mean(),
                }).reset_index()  
authors_stat

,author_name,,price max,price min,price mean
0,Островский,"(Островский, [author_id, author_name])",370,290,330.000000
1,Тургенев,"(Тургенев, [author_id, author_name, book_title])",450,300,366.666667
2,Чехов,"(Чехов, [author_id, author_name])",500,450,475.000000

Не разобрался почему вместо 4 заявленных столбццов добавляет 5 столбцов, но лучше не придумалось :(